/* Navigation Services - Localizable Strings */

/* Nav Dialog title strings */
"Open Default Title" = "Avaa";
"Open Title" = "Avaa: ^0";
"Save Default Title" = "Tallenna";
"Save Title" = "Tallenna: ^0";
"Choose File Title" = "Valitse tiedosto";
"Choose Folder Title" = "Valitse kansio";
"Choose Volume Title" = "Valitse taltio";
"Choose Object Title" = "Valitse kohde";
"New Folder Title" = "Uusi kansio";

/* Button title strings */
"Save Button" = "Tallenna";
"Open Button" = "Avaa";
"Choose Button" = "Valitse";
"Don't Save Button" = "Älä tallenna";
"New Folder Button" = "Uusi kansio";
"Replace Button" = "Korvaa";
"Discard Button" = "Hylkää muutokset";
"Review Button" = "Tarkasta muutokset...";
"Use Dot Button" = "Käytä ”.”";
"ExtensionAlertUseOneLabel" = "Käytä .^1";
"ExtensionAlertUserBothLabel" = "Käytä molempia";

/* Confirm Alert strings */
"SaveChangesClosing Banner" = "Tallenna muutokset ennen sulkemista";
"SaveChangesQuitting Banner" = "Tallenna muutokset ennen lopetusta";
"SaveChangesOther Banner" = "Tallenna muutokset";
"DiscardChanges Banner" = "Älä tallenna";
"WantToSaveDoc Banner" = "Haluatko tallentaa dokumenttiin ”^0” tehdyt muutokset?";
"WantToSaveThis Banner" = "Haluatko tallentaa dokumenttiin tehdyt muutokset?";
"WantToSaveAppDocs Banner" = "Haluatko tallentaa ^0 dokumentteihin tehdyt muutokset?";
"WantToDiscardDoc Banner" = "Haluatko hylätä muutokset dokumentissa ”^0”?";
"WantToDiscardThis Banner" = "Hylätäänkö dokumenttiin tehdyt muutokset?";

"Review App Docs Banner" = "Sinulla on ^0 ^1 dokumenttia, joiden muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";
"Review Several App Docs Banner" = "Sinulla on useita ^1 dokumentteja, joiden muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";

"Review Docs Banner" = "Sinulla on ^0 dokumenttia, joiden muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";
"Review Several Docs Banner" = "Sinulla on useita dokumentteja, joiden muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";

"Review App Single Doc Banner" = "Sinulla on ^0 ^1 dokumenttia, joiden muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";
"Review Single Doc Banner" = "Sinulla on ^0 dokumentti, jonka muutoksia ei ole tallennettu. Haluatko tarkistaa muutokset ennen lopettamista?";

"Review Docs Explanation" = "Jos et tarkasta dokumentteja, kaikki muutokset häviävät.";

/* Untitled strings */
"Untitled Folder" = "nimetön kansio";
"Untitled Doc" = "nimetön";

/* Alert strings */
"Cant Replace Locked" = "Et voi korvata kohdetta ”^0”, koska se on lukittu.";

"Remove Favorite" = "Poista suosikki";
"Cant Resolve Alias NotFound" = "Suosikkikohdetta ”^0” ei voitu avata, koska alkuperäistä kohdetta ei löytynyt";
"Navigate Alias Not Found" = "Aliasta ”^0” ei voitu avata, koska alkuperäistä kohdetta ei löydy.";

"Name Already Taken" = "Kohde ”^0” on jo varattu. Käytä toista nimeä.";
"Cant Replace Folder" = "Nimi ”^0” on jo kansion käytössä.";
"Cant NewFolder OnLockedDisk" = "Et voi luoda uutta kansiota, koska levy on lukittu.";
"Not Right Privs" = "Et voi korvata kohdetta ”^0”, koska sinulla ei ole tarvittavia oikeuksia.";
"Cant use period" = "Pisteellä ”.” alkavat nimet on varattu järjestelmän käyttöön. Jos haluat kuitenkin käyttää pisteellä alkavaa tiedostonimeä, tiedosto piilotetaan.";

"ExtensionWarningText" = "Haluatko varmasti tallentaa tämän dokumentin tarkentimella ”.^0”? Ehdotettu tarkennin on ”.^1”.";
"ExtensionWarningSubtext" = "Jos tarkenninta ”.^1” ei käytetä, dokumentti saatetaan tallentaa toisessa muodossa.";

"ExtensionErrorText" = "Tiedostoa ei voida tallentaa nimen lopussa olevalla tarkentimella ”.^0.”. Vaadittu tarkennin on ”.^1”.";
"ExtensionErrorSubtext" = "Voit käyttää molempia, jolloin tiedostopääte on ”.^0.^1”.";

"ReplaceAlertText" = "Kohde nimeltä ”^0” sijaitsee jo tässä paikassa. Haluatko korvata sen tallennettavalla?";
"ReplaceWithExtensionAlertText" = "Kohde nimeltä ”^0” tarkentimella ”.^1” sijaitsee jo tässä paikassa. Haluatko korvata sen tallennettavalla?";


/* Favorite Popup Menu strings */
"Favorite Places" = "Suosikkikohteet";
"Recent Places"	= "Äskeiset sijainnit";
"Computer" = "Tietokone";
"Home menu item" = "Koti";

/* Show Popup Menu strings */
"All Files" = "Kaikki dokumentit";
"All Known Files" = "Kaikki tunnetut dokumentit";
"All App" = "Kaikki ^0 dokumentit";
"All Readable Files" = "Kaikki luettavat dokumentit";

/* Format Popup Menu strings */
"Default" = "Oletus";

/* Generic Kind strings */
"Picture Document" = "Kuvadokumentti";
"Text Document" = "Tekstidokumentti";
"Movie Document" = "Elokuvadokumentti";
"Sound Document" = "Äänidokumentti";

/* array of command key characters:
	o	// command-key lower case O (open)
	.	// command-key character '.' (cancel)
	D	// upper character "D" (don't save button shortcut)
	d	// lower character "d" (don't save button shortcut)
	Z	// Undo menu command-key
	X	// Cut menu command-key
	C	// Copy menu command-key
	V	// Paste menu command-key
	A	// Select All menu command-key
	s	// command-key "s" (save)
	R	// upper character "R" (replace button shortcut)
	r	// lower character "r" (replace button shortcut)
	d	// command-key "d" (Desktop shortcut)
	D	// command-key displayed in Where popup (Desktop shortcut)
	H	// command-key "H"
*/
"Command Keys" = "o.DdZXCVAsRrdDH";

/* iDisk strings */
"iDisk title" = "iDisk";
"Connect Failed" = "Yhteys epäonnistui";
"Connect Failed Details" = "iDisk-palvelin ei vastaa. Yritä uudelleen.";
"Invalid Setup" = "iDiskiä ei voida käyttää. Tunnus tai salasana voi olla väärin.";
"Invalid Setup Details" = "Voit vaihtaa salasanaasi .Mac-välilehdellä Järjestelmäasetusten Internet-osassa.";
"iTools Button" = "Avaa .Mac-asetukset...";
"Authentication Failed" = "Kirjautuminen epäonnistui";
"Authentication Failed Detailed" = "Olet syöttänyt nimesi tai salasanasi väärin. Yritä uudelleen. Voit varmistaa .Mac-nimesi ja salasanasi .Mac-asetusten ikkunassa.";

/* List view column titles*/
"Name Column Title" = "Nimi";
"Date Modified Column Title" = "Muutosaika";

/* Authenticated Server strings */
"Connect Button" = "Yhdistä...";
"Connect Caption" = "Osoittamalla Yhdistä näet palvelimella ”^0” käytettävissä olevat jaot.";

/* Query strings */
"QueryItemCountString" = "%i kohdetta";
"CurrentFolderScopeString" = "Kansio ”%s”";
"HomeScopeString" = "Kotikansiosta";
"EverywhereScopeString" = "Tietokoneesta";

/* Preview strings */
"MoreInfo" = "lisätietoja...";
